УТ/src/ChartsOfCharacteristicTypes/СтатьиАктивовПассивов/СтатьиАктивовПассивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СтатьиАктивовПассивов</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Партнеры</types>
    <types>EnumRef.УдалитьТипыНалогов</types>
    <types>CatalogRef.ПрочиеАктивыПассивы</types>
    <types>EnumRef.СтатьиБезАналитики</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.ВидыНалоговВзносов</types>
    <types>CatalogRef.Склады</types>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СтатьиУправленческогоБаланса</name>
      <description>Статьи управленческого баланса</description>
      <code>00000000067</code>
      </content>
      </content>
        </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ЗапасыСобственные</name>
      <description>Запасы собственные</description>
      <code>00000002500</code>
    </items>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные средства</description>
      <code>00000003000</code>
    </items>
    <items>
      <name>ДепозитыКредитыЗаймыВыданные</name>
      <description>Депозиты, кредиты и займы выданные</description>
      <code>00000003500</code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчеты с поставщиками</description>
      <code>00000004500</code>
    </items>
    <items>
      <name>РасчетыСКлиентами</name>
      <description>Расчеты с клиентами</description>
      <code>00000005000</code>
    </items>
    <items>
      <name>КредитыЗаймыПолученные</name>
      <description>Кредиты и займы полученные</description>
      <code>00000006000</code>
    </items>
    <items>
      <name>РасчетыПоНалогам</name>
      <description>Расчеты по налогам</description>
      <code>00000006500</code>
    </items>
    <items>
      <name>РасчетыССотрудниками</name>
      <description>Расчеты с сотрудниками</description>
      <code>00000007000</code>
    </items>
    <items>
      <name>ВнутрихозяйственныеРасчеты</name>
      <description>Внутрихозяйственные расчеты</description>
      <code>00000008000</code>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>00000008500</code>
    </items>
    <items>
      <name>ДоходыРасходы</name>
      <description>Доходы и расходы</description>
      <code>00000009000</code>
    </items>
    <items>
      <name>ЗапасыПринятые</name>
      <description>Запасы принятые</description>
      <code>00000010500</code>
    </items>
    <items>
      <name>СлужебныеСтатьи</name>
      <description>Служебные статьи</description>
      <code>00000011000</code>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АктивПассив</name>
    <type>
      <types>EnumRef.ВидыСтатейУправленческогоБаланса</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОборот</name>
    <comment>Управляет показом оборота в отчете &quot;Управленческий баланс&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДебетаСтатьи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКредитаСтатьи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезАналитики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИсточникаДанныхБюджетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыСтатейАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыделениеДолгосрочныхАктивовОбязательств</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НесобственныеПодконтрольныеЦенности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОбъектовНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборОбъектовНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДетальныхНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвязиФункциональныхОпций</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетаУчетаВНастройкахПроводок</name>
    <comment>Счета международного учета указываются в настройках проводок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанныхУчета</name>
    <type>
      <types>EnumRef.ТипыДанныхУчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиМеждународногоУчета</name>
    <attributes>
      <name>ПланСчетов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФункциональныеОпции</name>
    <attributes>
      <name>ИмяФункциональнойОпции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РесурсыУпр</name>
    <comment>Балансовые ресурсы источника данных в валюте упр. учета</comment>
    <attributes>
      <name>ИмяРесурса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>EnumRef.ПоказателиАналитическихРегистров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РесурсыРегл</name>
    <comment>Балансовые ресурсы источника данных в валюте регл. учета</comment>
    <attributes>
      <name>ИмяРесурса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>EnumRef.ПоказателиАналитическихРегистров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РесурсыВал</name>
    <comment>Валютные ресурсы источника данных</comment>
    <attributes>
      <name>ИмяРесурса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>EnumRef.ПоказателиАналитическихРегистров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РесурсыКоличество</name>
    <comment>Количественные ресурсы источника данных</comment>
    <attributes>
      <name>ИмяРесурса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>EnumRef.ПоказателиАналитическихРегистров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПутиКДаннымСубконто</name>
    <attributes>
      <name>ВидСубконто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоказатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>EnumRef.ПоказателиАналитическихРегистров</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаРесурсов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРесурса</name>
      <comment>Имя ресурса источника данных</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

УТ/src/ChartsOfCharacteristicTypes/СтатьиАктивовПассивов/Forms/ФормаВыбораОбъектаУчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	НастройкиУчета = ПланыВидовХарактеристик.СтатьиАктивовПассивов.НастройкиФинансовогоУчета();
	НастройкиОтбора = ПланыВидовХарактеристик.СтатьиАктивовПассивов.НастройкиОтбораСтатейАктивовПассивов();
	
	Если ТипЗнч(Параметры.НастройкиФинансовогоУчета) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(НастройкиУчета, Параметры.НастройкиФинансовогоУчета);
	Иначе
		
		
	КонецЕсли;
	
	Если ТипЗнч(Параметры.ЕстьИсточникДанных) = Тип("Булево") Тогда
		НастройкиОтбора.ЕстьИсточникДанных = Параметры.ЕстьИсточникДанных;
	КонецЕсли;
	
	ВидыСтатей = Неопределено;
	ТипыДанныхУчета = Неопределено;
	СчетаУчетаВНастройкахПроводок = Ложь;
	НесобственныеПодконтрольныеЦенности = Ложь;
	
	Если Параметры.Свойство("Отбор") Тогда
		Если Параметры.Отбор.Свойство("Вид", ВидыСтатей) И ЗначениеЗаполнено(ВидыСтатей) Тогда
			НастройкиОтбора.Вид = ОбщегоНазначенияУТКлиентСервер.Массив(ВидыСтатей);
		КонецЕсли;
		Если Параметры.Отбор.Свойство("ТипДанныхУчета", ТипыДанныхУчета) И ЗначениеЗаполнено(ТипыДанныхУчета) Тогда
			НастройкиОтбора.ТипДанныхУчета = ОбщегоНазначенияУТКлиентСервер.Массив(ТипыДанныхУчета);
		КонецЕсли;
		Если Параметры.Отбор.Свойство("СчетаУчетаВНастройкахПроводок", СчетаУчетаВНастройкахПроводок) Тогда
			НастройкиОтбора.СчетаУчетаВНастройкахПроводок = СчетаУчетаВНастройкахПроводок;
		КонецЕсли;
		Если Параметры.Отбор.Свойство("НесобственныеПодконтрольныеЦенности", НесобственныеПодконтрольныеЦенности) Тогда
			НастройкиУчета.УчетНесобственныхЦенностей = НесобственныеПодконтрольныеЦенности;
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(
		ДеревоОбъектовУчета.ПолучитьЭлементы(),
		ПланыВидовХарактеристик.СтатьиАктивовПассивов.ДеревоОбъектовФинансовогоУчета(НастройкиУчета, НастройкиОтбора));
	
	РегистрыНакопленияМетаданные = Метаданные.РегистрыНакопления;
	
	Для каждого Группа Из ДеревоОбъектовУчета.ПолучитьЭлементы() Цикл
		Для каждого СтрокаОбъектУчета Из Группа.ПолучитьЭлементы() Цикл
			Если СтрокаОбъектУчета.ОбъектУчета = Параметры.ТекущаяСтрока Тогда
				Элементы.ДеревоОбъектовУчета.ТекущаяСтрока = СтрокаОбъектУчета.ПолучитьИдентификатор();
			КонецЕсли;
			
			МетаданныеРегистра = РегистрыНакопленияМетаданные.Найти(СтрокаОбъектУчета.ИсточникДанных);
			Если МетаданныеРегистра <> Неопределено Тогда
				СтрокаОбъектУчета.ИсточникДанныхПредставление = МетаданныеРегистра.Синоним;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоОбъектовУчета

&НаКлиенте
Процедура ДеревоОбъектовУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = ДеревоОбъектовУчета.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(ТекущиеДанные.ОбъектУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовУчетаВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекущиеДанные = ДеревоОбъектовУчета.НайтиПоИдентификатору(Значение);
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(ТекущиеДанные.ОбъектУчета);

КонецПроцедуры

#КонецОбласти
